Repository: ffneiva/rubiks_cube_solver
Catalog: lib/src/localization/app_*.arb
Languages: fr, pt

# appTitle
source: Rubik Cube Solver
fr: Solveur de Rubik's Cube
pt: Solucionador de Cubo Mágico

# settingsTitle
source: Settings
fr: Paramètres
pt: Configurações

# confirmButton
source: Confirm
fr: Confirmer
pt: Confirmar

# backButton
source: Back
fr: Retour
pt: Voltar

# closeButton
source: Close
fr: Fermer
pt: Fechar

source: Solve
fr: Résoudre
pt: Resolver

source: Error
fr: Erreur
pt: Erro

source: Date
pt: Data

source: Confirm Exit
fr: Confirmer la sortie
pt: Confirmar saída

# rubikPage
source: Rubik's Cube
fr: Cube de Rubik
pt: Cubo mágico

# settingsPage
source: Settings
fr: Paramètres
pt: Configurações

# historicPage
source: History
fr: Historique
pt: Histórico

# examplePage
source: Examples
fr: Exemples
pt: Exemplos

# aboutPage
source: About
fr: À propos
pt: Sobre

# solvePage
source: Solution
pt: Solução

source: General Settings
fr: Paramètres généraux
pt: Configurações gerais

source: Bluetooth Settings
pt: Configurações do bluetooth

source: Cube Settings
fr: Paramètres du cube
pt: Configurações do cubo

# settingsTheme
source: Theme
fr: Thème
pt: Tema

# settingsSystemTheme
source: System Theme
fr: Thème du système
pt: Tema do sistema

# settingsLightTheme
source: Light Theme
fr: Thème clair
pt: Tema claro

# settingsDarkTheme
source: Dark Theme
fr: Thème sombre
pt: Tema escuro

# settingsLanguage
source: Language
fr: Langue
pt: Linguagem

# settingsPortuguese
source: Portuguese
fr: Portugais
pt: Português

# settingsEnglish
source: English
fr: Anglais
pt: Inglês

# settingsSpanish
source: Spanish
fr: Espagnol
pt: Espanhol

# settingsFrench
source: French
fr: Français
pt: Francês

# settingsDeviceConnect
source: Connect Device
pt: Conectar dispositivo

# settingsBluetoothFirstChar
source: First Character
pt: Primeiro caractere

# settingsBluetoothMiddleChar
source: Middle Character
pt: Caractere do meio

# settingsBluetoothLastChar
source: Last Character
pt: Último caractere

# settingsPickColor
source: Pick a color
fr: Choisissez une couleur
pt: Selecione uma cor

# settingsUpColor
source: Top color
fr: Couleur du dessus
pt: Cor de cima

# settingsLeftColor
source: Left color
fr: Couleur de gauche
pt: Cor da esquerda

# settingsFrontColor
source: Front color
fr: Couleur de devant
pt: Cor da frente

# settingsRightColor
source: Right color
fr: Couleur de droite
pt: Cor da direita

# settingsBackColor
source: Back color
fr: Couleur de derrière
pt: Cor de trás

# settingsDownColor
source: Bottom color
fr: Couleur de dessous
pt: Cor de baixo

source: Projection
pt: Projeção

# projectionUp
source: Top side projection
fr: Projection du haut
pt: Projeção do lado de cima

# projectionLeft
source: Left side projection
fr: Projection de gauche
pt: Projeção do lado esquerdo

# projectionFront
source: Front side projection
fr: Projection de devant
pt: Projeção do lado da frente

# projectionRight
source: Right side projection
fr: Projection de droite
pt: Projeção do lado direito

# projectionBack
source: Back side projection
fr: Projection de derrière
pt: Projeção do lado de trás

# projectionDown
source: Bottom side projection
fr: Projection du bas
pt: Projeção do lado debaixo

# rubikCubeClearColors
source: Clear colors
fr: Effacer les couleurs
pt: Limpar cores

# rubikCubeCropper
source: Crop Image
pt: Cortar a imagem

# rubikCubeProjection
source: Projection
pt: Projeção

# historicErrorLoadingData
source: Error loading data
fr: Erreur lors du chargement des données
pt: Erro ao carregar os dados

# historicNoData
source: No data stored in history
fr: Aucune donnée stockée dans l'historique
pt: Nenhum dado armazenado no histórico

# historicClearData
source: Clear History
fr: Effacer l'historique
pt: Limpar histórico

# historicClearAllDataConfirmation
source: Confirm deletion of entire history?
fr: Confirmer la suppression de tout l'historique ?
pt: Confirma exclusão de todo o histórico?

# historicClearDataConfirmation
source: Confirm deletion of solution ({index}): "{solution}"?
fr: Confirmer la suppression de la solution ({index}): "{solution}" ?
pt: Confirma a exclusão da solução ({index}): "{solution}"?

# historicMovesQuantity
source: Number of Moves
fr: Quantité de mouvements
pt: Quantidade de movimentos

# historicDeleteButton
source: Delete
pt: Apagar

# exampleSolution
source: Solution
pt: Solução

# exampleCubeInCubeInCube
source: Cube in Cube in Cube
fr: Cube dans Cube dans Cube
pt: Cubo dentro de cubo dentro de cubo

# exampleAnaconda
source: Anaconda
pt: Cobra

# exampleCheckerboard
source: Checkerboard
fr: Échiquier
pt: Xadrez

# exampleCheckerboard2
source: Checkerboard 2
fr: Échiquier 2
pt: Tabuleiro

# exampleChickenFeet
source: Chicken Feet
fr: Pattes de Poulet
pt: Pés de galinha

# exampleCrossOne
source: Cross One
fr: Croix Un
pt: Cruz 1

# exampleCrossTwo
source: Cross Two
fr: Croix Deux
pt: Cruz 2

# exampleCubeInCube
source: Cube in Cube
fr: Cube dans Cube
pt: Cubo dentro de cubo

# exampleFourSpots
source: Four Spots
fr: Quatre Taches
pt: Quatro pontos

# examplePython
source: Python
pt: Cobra 2

# exampleSixSpots
source: Six Spots
fr: Six Taches
pt: Seis pontos

# exampleSixTs
source: Six T's
fr: Six T
pt: Seis T's

# exampleSolved
source: Solved
fr: Résolu
pt: Resolvido

# exampleSpiral
source: Spiral
fr: Spirale
pt: Espiral

# exampleStripes
source: Stripes
fr: Rayures
pt: Listras

# exampleTwister
source: Twister
fr: Torsion
pt: Torção

# exampleWire
source: Wire
fr: Fil
pt: Fio

# aboutExtensionProject
source: Extension Project
fr: Projet d'Extension
pt: Projeto de Extensão

# aboutExtensionProjectParagraphs
source: This app is a Flutter implementation of a solver for the Rubik's Cube, developed as part of an extension project at the Federal University of Goi√°s (UFG). It uses the Kociemba algorithm to find a solution with a minimal number of moves, close to the "God's number".
fr: Cette application est une implémentation en Flutter d'un solveur pour le Rubik's Cube, développée dans le cadre d'un projet d'extension à l'Université Fédérale de Goiás (UFG). Il utilise l'algorithme de Kociemba pour trouver une solution avec un nombre minimal de mouvements, proche du "nombre de Dieu".
pt: Este aplicativo é uma implementação em Flutter de um solver para o Cubo Mágico, desenvolvido como parte de um projeto de extensão na Universidade Federal de Goiás (UFG). Ele utiliza o algoritmo de Kociemba para encontrar uma solução com uma quantidade mínima de movimentos, próxima ao "número de Deus".

# aboutKociembaAlgorithm
source: Kociemba Algorithm
fr: Algorithme de Kociemba
pt: Algoritmo de Kociemba

# aboutKociembaAlgorithmParagraphs
source: The Kociemba algorithm reduces the cube to a state that requires only double-layer moves except in two opposite layers, "transforming" the cube into a 3x3x2, and then solves the cube with a maximum of 29 moves.
fr: L'algorithme de Kociemba réduit le cube à un état qui ne nécessite que des mouvements doubles sauf dans deux couches opposées, "transformant" le cube en un 3x3x2, puis résout le cube avec un maximum de 29 mouvements.
pt: O algoritmo de Kociemba reduz o cubo a um estado que requer apenas movimentações duplas exceto em duas camadas opostas, "transformando" o cubo em um 3x3x2, e depois resolve o cubo com um máximo de 29 movimentos.

# aboutGodNumber
source: God's Number
fr: Nombre de Dieu
pt: Número de Deus

# aboutGodNumberParagraphs
source: The "God's Number" is a metric referring to the maximum number of moves needed to solve any configuration of the Rubik's Cube, regardless of how it's scrambled. Mathematical studies have shown that God's Number is 20.
fr: Le "nombre de Dieu" est une métrique se référant au nombre maximum de mouvements nécessaires pour résoudre n'importe quelle configuration du Rubik's Cube, quelle que soit la manière dont il est mélangé. Des études mathématiques ont montré que le nombre de Dieu est 20.
pt: O "número de Deus" é uma métrica que se refere à quantidade máxima de movimentos necessários para resolver qualquer configuração do Cubo Mágico, independentemente de como ele esteja embaralhado. Estudos matemáticos demonstraram que o número de Deus é 20.

# solveAccess
source: Access solution
pt: Acessar solução

# solveReturnToTop
source: Return to top
pt: Voltar para início

# sendBluetooth
source: Send via bluetooth
pt: Enviar por bluetooth

# moveU
source: Top clockwise
pt: Topo horário

# moveUprime
source: Top counterclockwise
pt: Topo anti-horário

# moveU2
source: Top double
pt: Topo duplo

# moveL
source: Left clockwise
pt: Esquerda horário

# moveLprime
source: Left counterclockwise
pt: Esquerda anti-horário

# moveL2
source: Left double
pt: Esquerda duplo

# moveF
source: Front clockwise
pt: Frente horário

# moveFprime
source: Front counterclockwise
pt: Frente anti-horário

# moveF2
source: Front double
pt: Frente duplo

# moveR
source: Right clockwise
pt: Direita horário

# moveRprime
source: Right counterclockwise
pt: Direita anti-horário

# moveR2
source: Right double
pt: Direita duplo

# moveB
source: Back clockwise
pt: Atrás horário

# moveBprime
source: Back counterclockwise
pt: Atrás anti-horário

# moveB2
source: Back double
pt: Atrás duplo

# moveD
source: Down clockwise
pt: Base horário

# moveDprime
source: Down counterclockwise
pt: Base anti-horário

# moveD2
source: Down double
pt: Base duplo

# messageNotFilled
source: Did not fill all stickers
fr: Toutes les stickers n'ont pas été remplis
pt: Não preencheu todos os adesivos

# messageInvalidFilling
source: Invalid filling, change the colors
fr: Remplissage invalide, veuillez modifier les couleurs
pt: Preenchimento inválido, altere as cores

# messageNotFindSolution
source: Could not find a solution
fr: Impossible de trouver une solution
pt: Não foi possível encontrar uma solução

# messageCubeSolved
source: The cube is already solved
fr: Le cube est déjà résolu
pt: O cubo já está resolvido

# messageBluetoothError
source: Error while sending data via Bluetooth
pt: Erro ao enviar dados por bluetooth

# messageUnexpectedError
source: An unexpected error occurred
fr: Une erreur inattendue s'est produite
pt: Ocorreu um erro inesperado

# messageSolve
source: Solution of {moves} moves found in {time} seconds
fr: Solution trouvée en {moves} mouvements en {time} secondes
pt: Solução de {moves} movimentos encontrada em {time} segundos

# snackBarSolutionCopied
source: Solution copied to clipboard
pt: Solução copiada para a área de transferência
